words = ["价值链", "物流", "链条", "物流配送", "垂直整合", "闭环", "一站式服务", "分销",
    "垂直", "仓配", "两端", "打通", "一站式", "上下游", "产业链", "前端",
    "信息流", "库存管理", "端到端", "供应商整合", "上游", "仓储", "体系",
    "大宗商品", "重要环节", "环节", "供应", "延展", "供应商管理",
    "全球采购", "仓储物流", "贯通", "区域物流", "能源资源", "重构",
    "各个环节", "b2b", "保税仓储", "服务体系", "体系化", "智慧物流",
    "交易平台", "一条龙", "全球化", "生态圈", "业务流程", "全方位",
    "配套服务", "本地化", "数智化", "整合", "物流信息", "商流", "产品链"
    "集团化", "第三方物流", "渠道", "制造", "供货渠道", "物流管理",
    "供应商", "物流网络", "终端", "产品整合", "供货商", "生产商",
    "制造商", "供方", "厂商", "销售商", "全球采购", "供应", "集成商",
    "采购", "生产厂家", "生产厂商", "制造厂商", "厂家", "主机厂",
    "整车厂", "合作伙伴", "供货渠道", "贸易商", "采购商", "分销商",
    "客户群", "企业采购", "供货", "零配件", "汽车厂", "供应商",
    "客户", "供应方", "采购需求", "汽车品牌", "供应链", "核心客户",
    "大客户", "配套供应", "代工厂", "跨国企业", "车厂", "主要客户", 
    "零售商", "物料","家电企业", "车企", "零部件", "配套服务", "服务商",  "战略合作伙伴",
    "电池厂", "集中采购","比价", "材料采购", "原材料采购", "外协厂商", "采购成本控制"]
unique_words_ordered = []
for word in words:
    if word not in unique_words_ordered:
        unique_words_ordered.append(word)
output_file_path = '/Users/chenyaxin/Desktop/供应链风险指标测度/业绩说明会数据/supplychain_words.txt'

with open(output_file_path, 'w', encoding='utf-8') as file:
    # 遍历列表中的每个词语
    for word in unique_words_ordered:
        # 写入词语，每个词语占一行
        file.write(word + '\n')

print(f"词语列表已写入到 {output_file_path}")

