import pandas as pd

# 定义文件路径
input_file = '/Users/chenyaxin/Desktop/InternetTourismConvention/商家列表.csv'
tourism_file1 = '/Users/chenyaxin/Desktop/InternetTourismConvention/商家名称/根据业务筛选/旅游类商家-1500.xlsx'
tourism_file2 = '/Users/chenyaxin/Desktop/InternetTourismConvention/商家名称/根据业务筛选/前1500条商家筛选.xlsx'

output_file = '/Users/chenyaxin/Desktop/privacy/商家筛选/处理后的商家列表.csv'
df = pd.read_csv(input_file)
tourism_df1 = pd.read_excel(tourism_file1)
tourism_df2 = pd.read_excel(tourism_file2)

# 获取标记为旅游类的商家名称
tourism_companies1 = tourism_df1[tourism_df1['是否为旅游类'] == 1]['投诉商家'].tolist()
print(len(tourism_companies1))
tourism_companies2 = tourism_df2[tourism_df2['是否为旅游类'] == 1]['投诉商家'].tolist()
print(len(tourism_companies2))
# 合并两个旅游类商家列表
tourism_companies = set(tourism_companies1 + tourism_companies2)
print(len(tourism_companies))
keywords = [
    '健身', '整形', '医院', '医美', '手游', '驾校', '火锅', '房地产', '家居', '潮玩', '玩具', '拼多多', '手表', '中介', '生物', '轻奢', '厨具','共享','公寓','演出',
    '电脑', '宽带', '美术', '游戏', '课堂', '音乐', '阅读', '汽配', '果园', '物业', '环保', '母婴', '京东', '通信', '教育科技', '网络服务', '经销','网盘','出行',
    '相机', '会计', '学校', '医生', '床垫', '冰箱', '运动', '影音', '保健', '男装', '图书', '门窗', '出租车', '专营店', '照片', '鞋', '轻断食','外卖','买菜',
    '学堂', '瑜伽', '网教', '面包', '同仁堂', '体育', '方特', '坚果', '维修', '复印', '体脂', '贸易', '散热', '租赁', '法律', '电玩', '商城', '牛奶','打车',
    '短视频', '快递', '乐园', '小说', '婚纱', '公主', '知识', '手机', '学历', '餐饮', '安防', '药房', '家具', '4s', '纹绣', '科技发展', '店', '租房', '咨询', '加油',
    '祛痘', '钢琴', '英语', '数码', '皮肤', '家纺', '服饰', '地产', '设计师', '珠宝', '护肤', '雅思', '电竞', '摩托车', '摄像头', '生鲜', '生活', '蛋糕', '橱柜',
    '斗地主', '婚恋', '医疗', '充电宝', '顺风车', '家电', '家居', '快跑', '水果', '奶茶', '健康', '燕窝', '首饰', '电器', '营销', '卫浴', '电子商务', '数字科技', '闲置', '法考',
    '早教', '充电', '文学', '植发', '信息科技', '成语', '直播', '万科', '照明', '摄影', '食品', '工具', '美妆', '车饰', '万达', '旗舰店', '批发', '优选', '疫苗', '传播', '影视',
    '文具', '社区', '设备', '户外', '装饰', '视频', '专柜', '艺术', '美甲', '电动车', '商学院', '信息技术', '超市', '文玩', '商贸', '销售', '托管', '物流', '娱乐',
    '医药', '工艺', '灯饰', '购物', '宠物', '养殖', '家政', '百货', '游泳', '微信', '工厂', '舞蹈', '美容', '衣橱', '酒吧', '水产', '供应链', '隐形眼镜', '律师', '文化科技', '比萨', '日记',
    '文化传媒', '传媒文化', '数字技术', '能源科技', '馆', '营业厅', '培训', '麻将', '代购', '相声', '公园', '电子科技', '饰品', '学习机', '饮水机', '新闻', '地铁', '售后', '乳业', '电视',
    '电商', '凉茶', '餐厅', '网校', '权益保障', '披萨', 'suv', '洗衣', '奶粉', '半永久', '耳机', '显示器', '韩语', '共享单车', '麻辣烫', '笔记本', '快充', '企业管理',
    '彩妆', '编程', '留学', '眼镜', '零食', '茶饮', '顺丰', '58', '宅急送', '养生壶', '月嫂', '牧业', '美食', '童装', '牙刷', '学院','旅游','酒店','导航',
    '网约车', '合作社', '工程', '皮件', '置业', '鲜果', '婚庆', '教学', '菜场', '酒业', '运输', '燃气', '日用品', '企业服务', '中医', '女装', '学习','一卡通',
    '派送', '人力资源', '房产', '印刷', '单车', '考研', '婚姻', '空调', '窗帘', '房产', '物联网', '农业', '区块链', '广告', '口腔', '饮食', '建材', '咖啡', '影城', '电影',
    '化妆品', '女包', '盲盒', '体检', '搬家', '新能源', '酸奶', '数据恢复', '特卖', '药业', '眼科', '投影', 'TV', 'tv', '录屏', '减肥', '购书', '单词', '影业', '交友',
    '法务', '彩票', '交友', '恋爱', '木门', '足球', '寻爱', '相亲', '考试', '租车', '旅拍', '出租', '天气', '口腔', '书吧', '建材', '全屋定制', '木门', '日语', '自主洗', '产后修复',
    '闪送', '瓷砖', '洗碗机', '小吃', '整装', '集成灶', '厨卫', '鲜花', '翻译', '辅导', '厨房', '戏剧', '茶叶', '代驾', '食谱', '橱柜', '轮胎', '净水器', '地板', '装潢',
    '月子中心', '美语'
]

# 剔除包含关键词的商家名称和旅游类商家
def is_valid_company(name):
    for keyword in keywords:
        if keyword in name:
            return False
    if name in tourism_companies:
        return False
    return True

# 删除 '是否金融企业' 列中取值为 1 的行，并剔除包含关键词的商家名称和旅游类商家
df = df[(df['是否金融企业'] != 1) & df['投诉商家'].apply(is_valid_company)]

# 保存处理后的数据到新的 CSV 文件
df.to_csv(output_file, index=False)

print(f"处理后的数据已保存到 {output_file}")